#include <iostream>
using namespace std;
int main(){
    const int MAX = 1024;
    int n, a[MAX], k, gcd = 1;
    
    cin >> n >> k;
        
    int x = n, y = k;
    for(int i = 0; i < n; i++){
        cin >> a[i];
    }

    int position = 0;
    while(n > 1){
        if(position >= n) position = position % n;
        cout << a[position] << " ";
        for(int i = position; i < n - 1; i++)
            a[i] = a[i + 1];
       n--;
       position = position - 1 + k;
    }
    cout << a[0] << endl;

    return 0;
}


/*
Задача 3.Дадени са N на брой цели положителни числа разположени в кръг (т.е последното и първото са съседи) и число K, такова че 
N и K са взаимно прости (т.е нямат общи делители, освен единицата). Започвайки от нулевия елемент, да се изведат всички числа от кръга, 
придвижвайки се с K позиции на всяка итерация.

Вход:
На 1-вия ред на стандартния вход се въвеждат числата N и K, разделени с интервал. На следващия ред, разделени с интервал, се въвеждат 
N-те числа, разположени в кръг.

Изход:
На единствения ред на стандартния изход се извеждат N-те числа, подредени по гореуказания начин.

Пример:
Вход:
10 3
1 2 3 4 5 6 7 8 9 10
Изход:
1 4 7 10 5 9 6 3 8 2

Ограничения: 2 <= N <= 1024
*/