#include <iostream>
using namespace std;
int main(){
    const int MAX = 1024;
    int n, a[MAX], k, gcd = 1;
    do{
        cin >> n >> k;
        
        int x = n, y = k;
        while(x != y){
            if(x < y){
                int tmp = x;
                x = y;
                y = tmp;
            }
            x -= y;
        }
        gcd = x;

        if(gcd != 1){
            cout << "Please insert two numbers whose greatest common divisor is 1" << endl;
        }
    }while(gcd != 1);

    for(int i = 0; i < n; i++){
        cin >> a[i];
    }

    int count = n - 1;
    int i = 0;
    cout << a[i] << " ";
    while(count > 0){
        if(i + k > n){
            if(!(n % 2)){
                i = ((i + 1 + k) % k) + 1;
            }
            else{
                i = ((i + 1 + k) % k);
            }
            cout << a[i] << " ";
        }else{
            cout << a[i + k] << " ";
            i = i + k;
        }
        count--;
    }

    return 0;
}


/*
Задача 3.Дадени са N на брой цели положителни числа разположени в кръг (т.е последното и първото са съседи) и число K, такова че 
N и K са взаимно прости (т.е нямат общи делители, освен единицата). Започвайки от нулевия елемент, да се изведат всички числа от кръга, 
придвижвайки се с K позиции на всяка итерация.

Вход:
На 1-вия ред на стандартния вход се въвеждат числата N и K, разделени с интервал. На следващия ред, разделени с интервал, се въвеждат 
N-те числа, разположени в кръг.

Изход:
На единствения ред на стандартния изход се извеждат N-те числа, подредени по гореуказания начин.

Пример:
Вход:
10 3
1 2 3 4 5 6 7 8 9 10
Изход:
1 4 7 10 3 6 9 2 5 8

Ограничения: 2 <= N <= 1024
*/